//** @file
//   Strings for DEBUG Message Config utility DXE
//
//;******************************************************************************
//;* Copyright (c) 2016, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"

#string STR_BLANK_STRING                                                   #language en-US " "
                                                                           #language fr-FR " "
                                                                           #language zh-TW " "
                                                                           #language ja-JP " "
                                                                           #language it-IT " "
                                                                           #language es-ES " "
                                                                           #language de-DE " "
                                                                           #language pt-PT " "	
#string STR_DISABLED_TEXT                                                  #language en-US "Disabled"
                                                                           #language fr-FR "Désactiver"
                                                                           #language zh-TW "\wide停用\narrow"
                                                                           #language ja-JP "\wide使用しない\narrow"
                                                                           #language it-IT "Disabilitato"
                                                                           #language es-ES "inhabilitado"
                                                                           #language de-DE "Sperren"
                                                                           #language pt-PT "Proibir"
#string STR_ENABLED_TEXT                                                   #language en-US "Enabled"
                                                                           #language fr-FR "Activer"
                                                                           #language zh-TW "\wide啟用\narrow"
                                                                           #language ja-JP "\wide使用する\narrow"
                                                                           #language it-IT "abilitato"
                                                                           #language es-ES "permitido"
                                                                           #language de-DE "Aktivieren"
                                                                           #language pt-PT "Permitir"
																		   
#string STR_NAME_VALUE_VAR_NAME0                                           #language en-US "MyNameValue0"
													 
//
// Formset H2O_DEBUG_MESSAGE_CONFIG_UTIL_EVENT_AND_MESSAGE_PAGE_FORMSET_GUID
//
#string H2O_DEBUG_MESSAGE_CONFIG_UTIL_EVENT_AND_MESSAGE_PAGE_FORMSET       #language en-US "H2O Serial Debug Message Config Utility"
#string H2O_DEBUG_MESSAGE_CONFIG_UTIL_EVENT_AND_MESSAGE_PAGE_FORMSET_HELP  #language en-US "Show Serial Debug Messages."
//
// Formset H2O_DEBUG_MESSAGE_CONFIG_UTIL_CONFIG_PAGE_FORMSET_GUID
//
#string H2O_DEBUG_MESSAGE_CONFIG_UTIL_CONFIG_PAGE_FORMSET                  #language en-US "H2O Serial DEBUG Message Config Utility"
#string H2O_DEBUG_MESSAGE_CONFIG_UTIL_CONFIG_PAGE_FORMSET_HELP             #language en-US "Config Serial DEBUG Message."

//
// VFR_FORMID_DEBUG_MESSAGE_CONFIG_PAGE
//
#string STR_SERIAL_DEBUG_MESSAGE_CONFIG_PAGE                               #language en-US "Serial Debug Message Configuration"
#string STR_SERIAL_DEBUG_MESSAGE_CONFIG_PAGE_HELP                          #language en-US "Show Serial Debug Message Configuration."

#string STR_EFI_DEBUG_MESSAGE_CONFIG                                       #language en-US "EFI DEBUG Message Configuration"
#string STR_STATUS_CODE_SERIAL_MESSAGE_CONFIG                              #language en-US "Status Code Serial Message Configuration"

//
// VFR_FORMID_DEBUG_MESSAGE_EVENT_AND_MESSAGE_PAGE
//
#string STR_SERIAL_DEBUG_MESSAGE_VIEWER_PAGE                               #language en-US "Serial Debug Message Viewer"
#string STR_SERIAL_DEBUG_MESSAGE_VIEWER_PAGE_HELP                          #language en-US "Show Serial Debug Message page."
#string STR_SERIAL_DEBUG_MESSAGE_VIEWER_SHOW_SERIAL_DEBUG_MSG              #language en-US "Show Serial Debug Message"
#string STR_SERIAL_DEBUG_MESSAGE_VIEWER_SHOW_SERIAL_DEBUG_MSG_HELP         #language en-US "Show all of the Serial Debug Messages."
#string STR_SERIAL_DEBUG_MESSAGE_VIEWER_SAVE_SERIAL_DEBUG_MSG              #language en-US "Save Serial Debug Message"
#string STR_SERIAL_DEBUG_MESSAGE_VIEWER_SAVE_SERIAL_DEBUG_MSG_HELP         #language en-US "Save all of the Serial Debug Messages."
#string STR_SHOW_SERIAL_DEBUG_MSG_PREVIOUS_PAGE                            #language en-US "Show Previous Page Messages"
#string STR_SHOW_SERIAL_DEBUG_MSG_NEXT_PAGE                                #language en-US "Show Next Page Messages"
//
// Debug Message Level
//
#string STR_EFI_DEBUG_LEVEL_MSG_PROMPT                                     #language en-US "  EFI DEBUG Message Level"    
#string STR_EFI_DEBUG_LEVEL_MSG_HELP                                       #language en-US "Set the level of EFI DEBUG Message.\n - Default: Set by PCD.\n - Information: Set by DEBUG_INFO.\n - Error: Set by DEBUG_ERROR.\n - Warning: Set by DEBUG_WARN.\n - Verbose: Set all bits but without DEBUG_POOL and DEBUG_PAGE.\n - Disable: No output message."
#string STR_DEBUG_DISABLE_STRING                                           #language en-US "Disabled"
#string STR_DEBUG_DEFAULT_STRING                                           #language en-US "Default"
#string STR_DEBUG_INFO_STRING                                              #language en-US "Information"
#string STR_DEBUG_ERROR_STRING                                             #language en-US "Error"
#string STR_DEBUG_WARN_STRING                                              #language en-US "Warning"
#string STR_DEBUG_VERBOSE_STRING                                           #language en-US "Verbose"
#string STR_SHOW_PROGRESS_CODE_MESSAGE_STRING                              #language en-US "  Show Progress Code Serial Message"
#string STR_SHOW_PROGRESS_CODE_MESSAGE_HELP                                #language en-US "Enabled - Progress Code message will show on serial port. \nDisabled- Don't show any Progress Code message"
#string STR_SHOW_ERROR_CODE_MESSAGE_STRING                                 #language en-US "  Show Error Code Serial Message"
#string STR_SHOW_ERROR_CODE_MESSAGE_HELP                                   #language en-US "Enabled - Error Code and ASSERT() message will show on serial port. \nDisabled- Don't show any Error Code and ASSERT() message"
#string STR_SHOW_DEBUG_CODE_MESSAGE_STRING                                 #language en-US "  Show Debug Code Serial Message"
#string STR_SHOW_DEBUG_CODE_MESSAGE_HELP                                   #language en-US "Enabled - Debug Code and other code type message will show on serial port. \nDisabled- Don't show any Debug Code and other code type message"		
//[-start-160218-IB08400332-add]//
#string STR_DEBUG_ADVANCED_MODE_STRING                                     #language en-US "  Advanced Mode"
#string STR_DEBUG_ADVANCED_MODE_HELP                                       #language en-US "Set all kinds of EFI DEBUG print error levels."
#string STR_DEBUG_ADV_INIT_STRING                                          #language en-US "    DEBUG_INIT"
#string STR_DEBUG_ADV_WARN_STRING                                          #language en-US "    DEBUG_WARN"
#string STR_DEBUG_ADV_LOAD_STRING                                          #language en-US "    DEBUG_LOAD"
#string STR_DEBUG_ADV_FS_STRING                                            #language en-US "    DEBUG_FS"
#string STR_DEBUG_ADV_INFO_STRING                                          #language en-US "    DEBUG_INFO"
#string STR_DEBUG_ADV_DISPATCH_STRING                                      #language en-US "    DEBUG_DISPATCH"
#string STR_DEBUG_ADV_VARIABLE_STRING                                      #language en-US "    DEBUG_VARIABLE"
#string STR_DEBUG_ADV_BM_STRING                                            #language en-US "    DEBUG_BM"
#string STR_DEBUG_ADV_BLKIO_STRING                                         #language en-US "    DEBUG_BLKIO"
#string STR_DEBUG_ADV_NET_STRING                                           #language en-US "    DEBUG_NET"
#string STR_DEBUG_ADV_UNDI_STRING                                          #language en-US "    DEBUG_UNDI"
#string STR_DEBUG_ADV_LOADFILE_STRING                                      #language en-US "    DEBUG_LOADFILE"
#string STR_DEBUG_ADV_EVENT_STRING                                         #language en-US "    DEBUG_EVENT"
#string STR_DEBUG_ADV_GCD_STRING                                           #language en-US "    DEBUG_GCD"
#string STR_DEBUG_ADV_CACHE_STRING                                         #language en-US "    DEBUG_CACHE"
#string STR_DEBUG_ADV_VERBOSE_STRING                                       #language en-US "    DEBUG_VERBOSE"
#string STR_DEBUG_ADV_ERROR_STRING                                         #language en-US "    DEBUG_ERROR"

//[-end-160218-IB08400332-add]//


//
// End of file
//